Connected to Dynamips VM "Plovdiv" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
ROMMON emulation microcode.

                           Launching IOS image at 0x80008000...

                                                               Smart Init is dis                            abled. IOMEM set to: 5

                        Using iomem percentage: 5

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 3700 Software (C3725-ADVSECURITYK9-M), Version 12.4(3), RELE                            ASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2005 by Cisco Systems, Inc.
Compiled Fri 22-Jul-05 02:27 by hqluong
Image text-base: 0x6000905C, data-base: 0x61B4A000


 BIST FAILED...Port Statistics for unclassified packets is not turned on.

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 3725 (R7000) processor (revision 0.1) with 124928K/6144K bytes of memory.
Processor board ID FTX0945W0MY
R7000 CPU at 240MHz, Implementation 39, Rev 2.1, 256KB L2, 512KB L3 Cache
2 FastEthernet interfaces
2 Serial(sync/async) interfaces
DRAM configuration is 64 bits wide with parity enabled.
55K bytes of NVRAM.

SETUP: new interface FastEthernet0/0 placed in "shutdown" state
SETUP: new interface Serial0/0 placed in "shutdown" state
SETUP: new interface FastEthernet0/1 placed in "shutdown" state
SETUP: new interface Serial0/1 placed in "shutdown" state
% Crashinfo may not be recovered at flash:crashinfo
% This file system device reports an error


Press RETURN to get started!

sslinit fn

*Mar  1 00:00:02.119: %SW_VLAN-4-IFS_FAILURE: VLAN manager encountered file oper                            ation error: call = ifs_open/read / code = 3588 (No device available)
    / bytes transfered = 0
*Mar  1 00:00:02.199: %SYS-5-CONFIG_I: Configured from memory by console
*Mar  1 00:00:02.439: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3700 Software (C3725-ADVSECURITYK9-M), Version 12.4(3), RELE                            ASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2005 by Cisco Systems, Inc.
Compiled Fri 22-Jul-05 02:27 by hqluong
*Mar  1 00:00:02.451: %SNMP-5-COLDSTART: SNMP agent on host Plovdiv is undergoin                            g a cold start
*Mar  1 00:00:03.091: %LINK-5-CHANGED: Interface FastEthernet0/0, changed state                             to administratively down
*Mar  1 00:00:03.191: %LINK-5-CHANGED: Interface FastEthernet0/1, changed state                             to administratively down
*Mar  1 00:00:03.251: %LINK-5-CHANGED: Interface Serial0/0, changed state to adm                            inistratively down
*Mar  1 00:00:03.251: %LINK-5-CHANGED: Interface Serial0/1, changed state to adm                            inistratively down
*Mar  1 00:00:04.091: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et0/0, changed state to down
*Mar  1 00:00:04.191: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et0/1, changed state to down
*Mar  1 00:00:04.251: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0,                             changed state to down
*Mar  1 00:00:04.251: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1,                             changed state to down
Plovdiv#
Plovdiv#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Plovdiv(config)#interface fastethernet 0/0
Plovdiv(config-if)#ip address 172.0.0.1 255.255.255.128
Plovdiv(config-if)#no shutdown
Plovdiv(config-if)#ip address 172.0.0.1 255.255.255.128
*Mar  1 00:32:07.191: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:32:08.191: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Plovdiv(config-if)#interface fastethernet 0/1
Plovdiv(config-if)#ip address 172.0.0.65 255.255.255.128
% 172.0.0.0 overlaps with FastEthernet0/0
Plovdiv(config-if)#no shutdown
% 172.0.0.0 overlaps with FastEthernet0/0
FastEthernet0/1: incorrect IP address assignment
Plovdiv(config-if)#interface serial 0/0
Plovdiv(config-if)#ip address 151.212.110. 255.255.255.252
                                          ^
% Invalid input detected at '^' marker.

Plovdiv(config-if)#no shutdown
Plovdiv(config-if)#
*Mar  1 00:33:58.019: %LINK-3-UPDOWN: Interface Serial0/0, changed state to up
*Mar  1 00:33:59.019: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
Plovdiv(config-if)#
*Mar  1 00:34:22.227: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to down
Plovdiv(config-if)#





Connected to Dynamips VM "ESW1" (ID 1, type c3725) - Console port
Press ENTER to get the prompt.
tems, Inc.
Compiled Fri 22-Jul-05 02:27 by hqluong
*Mar  1 00:00:02.479: %SNMP-5-COLDSTART: SNMP agent on host ESW1 is undergoing a                             cold start
*Mar  1 00:00:02.495: %PCMCIAFS-5-DIBERR: PCMCIA disk 0 is formatted from a diff                            erent router or PC. A format in this router is required before an image can be b                            ooted from this device
*Mar  1 00:00:03.063: %LINK-5-CHANGED: Interface FastEthernet0/0, changed state                             to administratively down
*Mar  1 00:00:03.115: %LINK-5-CHANGED: Interface FastEthernet0/1, changed state                             to administratively down
*Mar  1 00:00:04.063: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et0/0, changed state to down
*Mar  1 00:00:04.115: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et0/1, changed state to down
*Mar  1 00:00:04.239: %LINK-5-CHANGED: Interface Vlan1, changed state to adminis                            tratively down
*Mar  1 00:00:04.279: %LINK-3-UPDOWN: Interface FastEthernet1/15, changed state                             to up
*Mar  1 00:00:04.283: %LINK-3-UPDOWN: Interface FastEthernet1/14, changed state                             to up
*Mar  1 00:00:04.283: %LINK-3-UPDOWN: Interface FastEthernet1/13, changed state                             to up
*Mar  1 00:00:04.287: %LINK-3-UPDOWN: Interface FastEthernet1/12, changed state                             to up
*Mar  1 00:00:04.287: %LINK-3-UPDOWN: Interface FastEthernet1/11, changed state                             to up
*Mar  1 00:00:04.291: %LINK-3-UPDOWN: Interface FastEthernet1/10, changed state                             to up
*Mar  1 00:00:04.291: %LINK-3-UPDOWN: Interface FastEthernet1/9, changed state t                            o up
*Mar  1 00:00:04.291: %LINK-3-UPDOWN: Interface FastEthernet1/8, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/7, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/6, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/5, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/4, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/3, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/2, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/1, changed state t                            o up
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state t                            o up
*Mar  1 00:00:05.239: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, cha                            nged state to down
*Mar  1 00:00:05.279: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/15, changed state to down
*Mar  1 00:00:05.283: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/14, changed state to down
*Mar  1 00:00:05.283: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/13, changed state to down
*Mar  1 00:00:05.287: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/12, changed state to down
*Mar  1 00:00:05.287: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/11, changed state to down
*Mar  1 00:00:05.287: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/10, changed state to down
*Mar  1 00:00:05.291: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/9, changed state to down
*Mar  1 00:00:05.291: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/8, changed state to down
*Mar  1 00:00:05.295: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                            et1/7, changed state to down

***************************************************************
This is a normal Router with a SW module inside (NM-16ESW)
It has been preconfigured with hard coded speed and duplex

To create vlans use the command "vlan database" from exec mode
After creating all desired vlans use "exit" to apply the config

To view existing vlans use the command "show vlan-switch brief"

Warning: You are using an old IOS image for this router.
Please update the IOS to enable the "macro" command!
***************************************************************


ESW1#
ESW1#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
ESW1(config)#interface vlan 10
ESW1(confT{R}X                                                                                              ESW1#}p
ESW1#
*Mar  1 00:34:25.799: %SYS-5-CONFIG_I: Configured from console by console
ESW1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
ESW1(config)#vlan 10 name administration
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#vlan 10 name administration
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#vlan 10
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#vlan 20 name production
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#vlan 10
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#vlan 20 name production
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#interface range faste
ESW1(config)#interface range fastethernet 1/1
ESW1(config-if-range)#switchport mode access
ESW1(config-if-range)#switchport  access vlan 1-
                                               ^
% Invalid input detected at '^' marker.

ESW1(config-if-range)#switchport  access vlan 10
%Access VLAN 10 does not exist. Please add it to vlan database
ESW1(config-if-range)#configure terminal
                       ^
% Invalid input detected at '^' marker.

ESW1(config-if-range)#configure terminal
ESW1(config-if-range)#configure terminal
                       ^
% Invalid input detected at '^' marker.

ESW1(config-if-range)#exit
ESW1(config)#exit
ESW1#
*Mar  1 00:45:56.483: %SYS-5-CONFIG_I: Configured from console by console
ESW1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
ESW1(config)#vlan 10 name administration
                  ^
% Invalid input detected at '^' marker.

ESW1(config)#vlan 10
