% културен_обект(Име, Град, Период, Тип).
културен_обект(плиска, шумен, античност, археологически_резерват).
културен_обект(преслав, шумен, средновековие, археологически_резерват).
културен_обект(рилски_манастир, рила, средновековие, манастир).
културен_обект(етъра, габрово, възраждане, етнографски_комплекс).
културен_обект(соц_музей, перник, съвремие, музей).
културен_обект(боянска_църква, софия, средновековие, църква).
културен_обект(археологически_музей, софия, античност, музей).
културен_обект(старият_пловдив, пловдив, възраждане, архитектурен_резерват).
културен_обект(къща_на_вазов, сопот, възраждане, музей).

обекти_по_период(Период, Списък) :-
    findall(Име, културен_обект(Име, _, Период, _), Списък).

обекти_в_град(Град, Име) :-
културен_обект(Име, Град, _, _).

обекти_по_тип(Тип, Име) :-
културен_обект(Име, _, _, Тип).

% С findall събирам всички обекти за даден период
% append съединява двата ми списъка
обекти_от_два_периода(Период1, Период2, ОбединенСписък) :-
findall(Име1, културен_обект(Име1, _, Период1, _), Списък1),
findall(Име2, културен_обект(Име2, _, Период2, _), Списък2),
append(Списък1, Списък2, ОбединенСписък).

въведи_период :-
    write('Въведете период (например: античност, средновековие, възраждане, съвремие): '), nl,
    read(Период),
    обекти_по_период(Период, Списък),
    write('Обекти за периода '), write(Период), nl,
    writeln(Списък).

% ?- обекти_по_период(възраждане, Y)
% ?- обекти_в_град(софия, Y)
% ?- обекти_по_тип(музей, Y)
% ?- обекти_от_два_периода(античност, възраждане, ОбединенСписък)
% ?- въведи_период
